# RebarBendData Properties (2022)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2022 API
---
RebarBendData Properties
RebarBendData Class See Also
---
The RebarBendData type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| BarDiameter | **Obsolete.** Defines bar model diameter of rebar |
| BarModelDiameter | Defines the model diameter of the bar. |
| BarNominalDiameter | Defines the nominal diameter of the bar. |
| BendRadius | The radius of all fillets, except hook fillets, in the Rebar shape. |
| HookAngle0 | The angle of the hook at the start. |
| HookAngle1 | The angle of the hook at the end. |
| HookBendRadius | The radius of the hook fillets in the Rebar shape. |
| HookLength0 | The extension length of the hook at the start. |
| HookLength1 | The extension length of the hook at the end. |
| HookOrient0 | The orientation of the hook at the start. |
| HookOrient1 | The orientation of the hook at the end. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
RebarBendData Class
Autodesk.Revit.DB.Structure Namespace